{
    "data": [
        {
            "node": {
                "id": 51535,
                "title": "Shingeki no Kyojin: The Final Season - Kanketsu-hen",
                "main_picture": {
                    "medium": "https://api-cdn.myanimelist.net/images/anime/1977/134922.jpg",
                    "large": "https://api-cdn.myanimelist.net/images/anime/1977/134922l.jpg"
                },
                "synopsis": "The conclusion to Shingeki no Kyojin."
            },
            "ranking": {
                "rank": 1
            }
        },
        {
            "node": {
                "id": 49387,
                "title": "Vinland Saga Season 2",
                "main_picture": {
                    "medium": "https://api-cdn.myanimelist.net/images/anime/1170/124312.jpg",
                    "large": "https://api-cdn.myanimelist.net/images/anime/1170/124312l.jpg"
                },
                "synopsis": "After his father's death and the destruction of his village at the hands of English raiders, Einar wishes for a peaceful life with his family on their newly rebuilt farms. However, fate has other plans: his village is invaded once again. Einar watches helplessly as the marauding Danes burn his lands and slaughter his family. The invaders capture Einar and take him back to Denmark as a slave. \n\nEinar clings to his mother's final words to survive. He is purchased by Ketil, a kind slave owner and landlord who promises that Einar can regain his freedom in return for working in the fields. Soon, Einar encounters his new partner in farm cultivation—Thorfinn, a dejected and melancholic slave. As Einar and Thorfinn work together toward their freedom, they are haunted by both sins of the past and the ploys of the present. Yet they carry on, grasping for a glimmer of hope, redemption, and peace in a world that is nothing but unjust and unforgiving.\n\n[Written by MAL Rewrite]"
            },
            "ranking": {
                "rank": 2
            }
        },
        {
            "node": {
                "id": 21,
                "title": "One Piece",
                "main_picture": {
                    "medium": "https://api-cdn.myanimelist.net/images/anime/1908/134986.jpg",
                    "large": "https://api-cdn.myanimelist.net/images/anime/1908/134986l.jpg"
                },
                "synopsis": "Gol D. Roger was known as the \"Pirate King,\" the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece—which promises an unlimited amount of riches and fame—and quite possibly the pinnacle of glory and the title of the Pirate King.\n\nEnter Monkey D. Luffy, a 17-year-old boy who defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate ransacking villages for fun, Luffy's reason for being a pirate is one of pure wonder: the thought of an exciting adventure that leads him to intriguing people and ultimately, the promised treasure. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach the most coveted of all fortunes—One Piece.\n\n[Written by MAL Rewrite] "
            },
            "ranking": {
                "rank": 3
            }
        },
        {
            "node": {
                "id": 50528,
                "title": "Golden Kamuy 4th Season",
                "main_picture": {
                    "medium": "https://api-cdn.myanimelist.net/images/anime/1855/128059.jpg",
                    "large": "https://api-cdn.myanimelist.net/images/anime/1855/128059l.jpg"
                },
                "synopsis": "The race to obtain the lost Ainu gold is nearing its peak, as even more formidable ex-prisoners are set on keeping their tattooed skins intact. Saichi \"The Immortal\" Sugimoto and Asirpa can finally move forward together, but Asirpa's time with Kiroranke and Ogata Hyakunosuke has slightly altered her ambition and strengthened her determination. As their party leaves the Russian territory, they gain a peculiar follower.\n\nMeanwhile, Toshizou Hijikata's crew makes major moves to get invaluable skins, falling into the poisonous trap of a dangerous convict. Although each group possesses a strong advantage over the others, even First Lieutenant Tokushirou Tsurumi—the most powerful and ruthless contender—cannot advance without Asirpa's help. However, his ominous plans for when they will inevitably meet remain a mystery.\n\n[Written by MAL Rewrite]"
            },
            "ranking": {
                "rank": 4
            }
        },
        {
            "node": {
                "id": 44042,
                "title": "Holo no Graffiti",
                "main_picture": {
                    "medium": "https://api-cdn.myanimelist.net/images/anime/1259/110227.jpg",
                    "large": "https://api-cdn.myanimelist.net/images/anime/1259/110227l.jpg"
                },
                "synopsis": "From unraveling the secrets of opening and closing doors to defusing surprise packages more commonly known as bombs, there is never a dull day at the Hololive Production office! Holo no Graffiti follows an eccentric cast of Virtual YouTubers, also known as \"VTubers,\" going about their absurd yet hilarious daily lives, detailing all their cute moments and mishaps.\n\n[Written by MAL Rewrite]"
            },
            "ranking": {
                "rank": 5
            }
        },
        {
            "node": {
                "id": 235,
                "title": "Detective Conan",
                "main_picture": {
                    "medium": "https://api-cdn.myanimelist.net/images/anime/7/75199.jpg",
                    "large": "https://api-cdn.myanimelist.net/images/anime/7/75199l.jpg"
                },
                "synopsis": "Shinichi Kudou, a high school student of astounding talent in detective work, is well known for having solved several challenging cases. One day, when Shinichi spots two suspicious men and decides to follow them, he inadvertently becomes witness to a disturbing illegal activity. Unfortunately, he is caught in the act, so the men dose him with an experimental drug formulated by their criminal organization, leaving him to his death. However, to his own astonishment, Shinichi lives to see another day, but now in the body of a seven-year-old child.\n\nPerfectly preserving his original intelligence, he hides his real identity from everyone, including his childhood friend Ran Mouri and her father, private detective Kogorou Mouri. To this end, he takes on the alias of Conan Edogawa, inspired by the mystery writers Arthur Conan Doyle and Ranpo Edogawa.\n\nDetective Conan follows Shinichi who, as Conan, starts secretly solving the senior Mouri's cases from behind the scenes with his still exceptional sleuthing skills, while covertly investigating the organization responsible for his current state, hoping to reverse the drug's effects someday.\n\n[Written by MAL Rewrite]"
            },
            "ranking": {
                "rank": 6
            }
        },
        {
            "node": {
                "id": 37822,
                "title": "Douluo Dalu 2nd Season",
                "main_picture": {
                    "medium": "https://api-cdn.myanimelist.net/images/anime/1538/93566.jpg",
                    "large": "https://api-cdn.myanimelist.net/images/anime/1538/93566l.jpg"
                },
                "synopsis": "Second season of Douluo Dalu."
            },
            "ranking": {
                "rank": 7
            }
        },
        {
            "node": {
                "id": 47794,
                "title": "MILGЯAM",
                "main_picture": {
                    "medium": "https://api-cdn.myanimelist.net/images/anime/1497/112023.jpg",
                    "large": "https://api-cdn.myanimelist.net/images/anime/1497/112023l.jpg"
                },
                "synopsis": "Es awakens in the facility Milgram to find a strange talking animal named Jackalope staring them down. Soon, they learn their purpose: as the prison guard, Es must delve into the psyches of 10 inmates, each of them imprisoned for causing the loss of life in some form or another. Their fates rest in Es' hands. Do the means justify an end, and how much does intent matter if the result is death? No matter how the lines between good and evil, right and wrong, and just and cruel are blurred, there are only two options Es can choose between: innocent or guilty.\n\n[Written by MAL Rewrite]\n"
            },
            "ranking": {
                "rank": 8
            }
        },
        {
            "node": {
                "id": 51039,
                "title": "Doupo Cangqiong: Nian Fan",
                "main_picture": {
                    "medium": "https://api-cdn.myanimelist.net/images/anime/1419/126374.jpg",
                    "large": "https://api-cdn.myanimelist.net/images/anime/1419/126374l.jpg"
                },
                "synopsis": "Fifth season of Doupo Cangqiong."
            },
            "ranking": {
                "rank": 9
            }
        },
        {
            "node": {
                "id": 966,
                "title": "Crayon Shin-chan",
                "main_picture": {
                    "medium": "https://api-cdn.myanimelist.net/images/anime/10/59897.jpg",
                    "large": "https://api-cdn.myanimelist.net/images/anime/10/59897l.jpg"
                },
                "synopsis": "There is no such thing as an uneventful day in the life of kindergartener Shinnosuke \"Shin-chan\" Nohara. The five-year-old is a cut above the most troublesome, perverted, and shameless kid one can imagine. Shin-chan is almost always engaged in questionable activities such as forgetting about a friend during hide and seek, sumo wrestling for love, performing various gags including the notorious \"elephant\" in public, and flirting with college girls. The exemplary troublemaker has done it all and has no plans to stop anytime soon.\n\nCrayon Shin-chan follows the daily shenanigans of Shin-chan with his group of friends, parading around as the self-proclaimed \"Kasukabe Defense Force.\" The adults witnessing these shenanigans unfold can't help but adore Shin-chan, as he keeps them entertained while unintentionally solving their daily troubles through his mindless antics—leaving himself as the only problem they do not know what to do with.\n\n[Written by MAL Rewrite]"
            },
            "ranking": {
                "rank": 10
            }
        }
    ],
    "paging": {
        "next": "https://api.myanimelist.net/v2/anime/ranking?offset=10&ranking_type=airing&limit=10&fields=synopsis"
    }
}
